app/controllers/onboard_controller.rb

SELECT "customer_infos".* FROM "customer_infos" WHERE "customer_infos"."mobile" = $1 LIMIT $2  [["mobile", "7060827478"], ["LIMIT", 1]]
---
  def create
    @customer_info = CustomerInfo.find_or_initialize_by(mobile: customer_info_params[:mobile].squish)