app/controllers/sessions_controller.rb

SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "johndoe@example.com"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "mobile", "email", "password_digest", "last_sign_in_at", "dob", "otp", "company_name", "role", "role_code", "role_id", "logo", "selfie_url", "old_password", "address", "city", "state", "token", "permissions", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21) RETURNING "id"
---
  def create
    if User.exists?(email: user_params[:email])
      render json: {errors: ["Email already exists"], status: 400}
    else
      @user = User.new(user_params)
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["token", "[FILTERED]"], ["updated_at", "2024-05-25 13:36:06.950669"], ["id", 1]]
---
  def login

    @user = User.find_by(email: params[:email])
    if @user&.authenticate(params[:password])
      token = encode_token({user_id: @user.id})
      @user.update(token: token)